benchmarks/cassandra/workload_b/single_datacenter/3_nodes/1_replication_factor/consistency_one/2_run/500000_records_6_threads_run.txt
[OVERALL], RunTime(ms), 656827
[OVERALL], Throughput(ops/sec), 761.2354546935494
[TOTAL_GCS_PS_Scavenge], Count, 190
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 267
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04064997328063554
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 190
[TOTAL_GC_TIME], Time(ms), 267
[TOTAL_GC_TIME_%], Time(%), 0.04064997328063554
[READ], Operations, 475062
[READ], AverageLatency(us), 8003.444523030678
[READ], MinLatency(us), 2030
[READ], MaxLatency(us), 809983
[READ], 95thPercentileLatency(us), 20303
[READ], 99thPercentileLatency(us), 31791
[READ], Return=OK, 475062
[CLEANUP], Operations, 6
[CLEANUP], AverageLatency(us), 370521.0
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2224127
[CLEANUP], 95thPercentileLatency(us), 2224127
[CLEANUP], 99thPercentileLatency(us), 2224127
[UPDATE], Operations, 24938
[UPDATE], AverageLatency(us), 4035.782139706472
[UPDATE], MinLatency(us), 1797
[UPDATE], MaxLatency(us), 540159
[UPDATE], 95thPercentileLatency(us), 8123
[UPDATE], 99thPercentileLatency(us), 13183
[UPDATE], Return=OK, 24938